//========================================================================
//  
//  ██████╗ ███████╗██████╗ ██╗      ██████╗ ██╗   ██╗███████╗██╗  ██╗
//  ██╔══██╗██╔════╝██╔══██╗██║     ██╔═══██╗╚██╗ ██╔╝██╔════╝╚██╗██╔╝
//  ██║  ██║█████╗  ██████╔╝██║     ██║   ██║ ╚████╔╝ █████╗   ╚███╔╝ 
//  ██║  ██║██╔══╝  ██╔═══╝ ██║     ██║   ██║  ╚██╔╝  ██╔══╝   ██╔██╗ 
//  ██████╔╝███████╗██║     ███████╗╚██████╔╝   ██║   ███████╗██╔╝ ██╗
//  ╚═════╝ ╚══════╝╚═╝     ╚══════╝ ╚═════╝    ╚═╝   ╚══════╝╚═╝  ╚═╝
//  
//  ========================================================================
//  【工具名称】DeploySharp
//  【版权声明】© 2025 Yan Guojin. All Rights Reserved.
//  【开源协议】Apache License 2.0（请遵守许可证条款）
//  ------------------------------------------------------------------------
//  【功能简介】
//  1. 支持 OpenVINO、ONNX Runtime、TensorRT 等主流模型格式部署
//  2. 支持目标检测、图像分割、关键点检测等多种任务
//  3. 支持 YOLOv5-v12全系列模型部署，同时支持更多其它模型部署
//  4. 支持 C# .NET Framework 4.8 、.NET 6/7/8/9 桌面端和服务器端部署
//  ------------------------------------------------------------------------
//  【官方支持】
//  📌 GitHub仓库：https://github.com/guojin-yan/YoloDeployCsharp
//  📌 QQ交流群：945057948（加入获取最新资料）
//  📌 微信公众号：CSharp与边缘模型部署（教程+案例）
//  📌 CSDN博客：guojin.blog.csdn.net（技术文章）
//  ------------------------------------------------------------------------
//  【联系我们】
//  ✉ 商务合作：guojin_yjs@cumt.edu.cn / 微信：15253793309
//  🐞 Bug反馈：guojin_yjs@cumt.edu.cn / 微信：15253793309 / QQ群：945057948
//  ⚡ 技术支持：guojin_yjs@cumt.edu.cn / 微信：15253793309 / QQ群：945057948
//  ========================================================================
//  
//  【使用声明】
//  1. 本工具免费用于学术和非商业用途，如需修改源码，请保留版权信息并遵循 Apache 2.0 协议。
//  2. 使用本工具即表示您同意《用户许可协议》。
//  ========================================================================
//
//  【赞助支持】
//  🌟 如果本项目对您有帮助，欢迎赞助支持我们：
//  - 支付宝/微信赞助码：手机号15253793309
//========================================================================
using System;

namespace DeploySharp.ImageSharp.Demo
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
            AnomalibSegDemos.Run();
        }
    }
}
